# this block is in alphabetic order
caarlos0/git-add-remote kind:path
caarlos0/ports kind:path
caarlos0/zsh-git-fetch-merge kind:path
caarlos0/zsh-mkc
mafredri/zsh-async
rupa/z
Tarrasch/zsh-bd
zsh-users/zsh-completions
zsh-users/zsh-autosuggestions

# these should be at last!
#sindresorhus/pure
denysdovhan/spaceship-prompt
zsh-users/zsh-syntax-highlighting
zsh-users/zsh-history-substring-search
