# Based on the output of `brew bundle dump` (which must be run outside of tmux).
#
# {{ ansible_managed }}

cask_args appdir: '/Applications'

# tap 'caskroom/cask'
# tap 'homebrew/bundle'
# tap 'homebrew/core'
# tap 'homebrew/services'
tap "homebrew/cask-fonts"
tap "homebrew/cask-drivers"
# tap 'homebrew/cask-versions'
# tap 'frankhinek/tap'
# tap 'getantibody/tap'

# Taps only for Work macOS systems
{% if 'work' in group_names %}
# tap 'pachyderm/tap'
{% endif %}

# Packages to install on all macOS systems

# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Modern replacement for 'ls'
brew "exa"
# Simple, fast and user-friendly alternative to find
brew "fd"
# macOS CLI for managing custom icons for files and folders
brew "fileicon"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Colorize logfiles and command output
brew "grc"
# Mac App Store command-line interface
brew "mas"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Python package management tool
brew "poetry"
# Python 2 and 3 compatibility utilities (Can be removed if "poetry" formula is removed)
brew "six"
# Cross-shell prompt for astronauts
brew "starship"
# JavaScript toolchain manager for reproducible environments
brew "volta"
# Tool for managing your YubiKey configuration
brew "ykman"
# Shell extension to navigate your filesystem faster
brew "zoxide"

# ARCHIVE - Old apps I used to use
# brew 'getantibody/tap/antibody'
# brew 'awscli'
# brew 'frankhinek/tap/defaultbrowser'
# brew 'graphviz'
# brew 'hopenpgp-tools'
# brew 'kubectl'
# brew 'n'
# brew 'paperkey'
# brew 'pyenv-virtualenv'
# brew 'pyenv'
# brew 'terraform'
# Terminal multiplexer
# brew "tmux"
# brew 'tree'
# brew 'watch'
# brew 'wget'
# brew 'yarn'
# brew 'zsh'

# Packages to install only on Work macOS systems
{% if 'work' in group_names %}
# brew 's3cmd'
{% endif %}

# Applications to install on all macOS systems

# Password manager that keeps all passwords secure behind one password
cask "1password"
# Voice and text chat software
cask "discord"
# Docker Desktop to build and share containerized applications
cask "docker"
# Elgato FACECAM configuration tool
cask "elgato-camera-hub"
# Elgato Control Center
cask "elgato-control-center"
# Elgato Stream Deck
cask "elgato-stream-deck"
# Elgato Wave Link
cask "elgato-wave-link"
# Fast, feature-rich, GPU based terminal emulator
cask "kitty"
# Logitech Options
cask "logitech-options"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Collaboration platform for API development
cask "postman"
# Blazingly fast, totally extendable launcher
cask "raycast"
# Microsoft Visual Studio Code
cask "visual-studio-code"
# Application for configuring any YubiKey
cask "yubico-yubikey-manager"

# ARCHIVE - Old apps I used to use
# GPU-accelerated terminal emulator
# cask "alacritty"
# cask 'alfred'
# cask 'android-studio'
# cask 'frankhinek/tap/automounter-helper'
# cask 'dash'
# cask 'firefox'
# cask 'google-cloud-sdk'
# cask 'grammarly'
# cask 'kindle'
# cask 'sketch'
# cask 'slack'
# cask 'typora'

# Quick Look Plugins - https://github.com/sindresorhus/quick-look-plugins
# cask 'qlcolorcode'
# cask 'qlimagesize'
# cask 'qlmarkdown'
# cask 'qlstephen'
# cask 'quicklook-json'
# cask 'suspicious-package'

# Fonts to install on all macOS systems
# monospace
# cask 'font-camingocode'
# cask 'font-open-sans'
cask "font-fira-code"
# cask "font-fira-code-nerd-font"
# apps
brew "svn" # Only needed for DM Sans font download
cask "font-dm-sans"
# presentations
# cask 'font-bebas-neue'
# cask 'font-fontawesome'
# cask 'font-lato'
# cask 'font-poiret-one'
# cask 'font-questrial'
# cask 'font-roboto'
# cask 'font-roboto-condensed'
# cask 'font-ubuntu'

# Fonts to install on only on Work macOS systems
{% if 'work' in group_names %}
# cask 'font-raleway'
{% endif %}

# Casks to install only on Personal macOS systems
{% if 'personal' in group_names %}
# Multi-cloud backup application
cask "arq"
# Video communication and virtual meeting platform
cask "zoom"

# ARCHIVE
# cask 'adobe-creative-cloud'
# cask 'box-drive'
# cask 'microsoft-office'
# cask 'pycharm'
# cask 'transmission'
# cask 'virtualbox'
{% endif %}

# Casks to install only on Work macOS systems
{% if 'work' in group_names %}
# Collaborative team software
cask "figma"
# App to manage software development and track bugs
cask "linear-linear"

# ARCHIVE
# cask 'microsoft-remote-desktop-beta'
# cask 'microsoft-teams'
# cask 'sketchup-pro'
# cask 'vmware-fusion'
{% endif %}
