# Based on the output of `brew bundle dump` (which must be run outside of tmux).
#
# {{ ansible_managed }}

cask_args appdir: '/Applications'

tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'homebrew/bundle'
tap 'homebrew/core'
tap 'homebrew/services'
tap 'frankhinek/tap'
tap 'getantibody/tap'

# Taps only for Work macOS systems
{% if 'work' in group_names %}
tap 'pachyderm/tap'
{% endif %}

# Packages to install on all macOS systems
brew 'getantibody/tap/antibody'
brew 'awscli'
brew 'frankhinek/tap/defaultbrowser'
brew 'git'
brew 'gnupg'
brew 'graphviz'
brew 'hopenpgp-tools'
brew 'kubectl'
brew 'mas'
brew 'neovim'
brew 'paperkey'
brew 'pinentry-mac'
brew 'pyenv'
brew 'pyenv-virtualenv'
brew 'tree'
brew 'watch'
brew 'wget'
brew 'zsh'

# Packages to install only on Work macOS systems
{% if 'work' in group_names %}
brew 'gimme'
brew 'kubernetes-helm'
brew 'mercurial'
brew 'pachyderm/tap/pachctl@1.7'
brew 's3cmd'
{% endif %}

# Applications to install on all macOS sytems
cask '1password'
cask 'alfred'
cask 'astro'
cask 'frankhinek/tap/automounter-helper'
cask 'dash'
cask 'docker'
cask 'firefox'
cask 'google-cloud-sdk'
cask 'grammarly'
cask 'iterm2-beta'
cask 'kindle'
cask 'slack'
cask 'sourcetree'
cask 'typora'
cask 'virtualbox'
cask 'visual-studio-code'

# Quick Look Plugins - https://github.com/sindresorhus/quick-look-plugins
cask 'betterzip'
cask 'qlcolorcode'
cask 'qlimagesize'
cask 'qlmarkdown'
cask 'qlstephen'
cask 'quicklook-json'
cask 'suspicious-package'

# Fonts to install on all macOS systems
# monospace
cask 'font-camingocode'
cask 'font-open-sans'
cask 'font-fira-code'
# presentations
cask 'font-bebas-neue'
cask 'font-fontawesome'
cask 'font-lato'
cask 'font-poiret-one'
cask 'font-questrial'
cask 'font-roboto'
cask 'font-roboto-condensed'
cask 'font-ubuntu'

# Casks to install only on Personal macOS systems
{% if 'personal' in group_names %}
cask 'adobe-creative-cloud'
cask 'arq'
cask 'box-drive'
cask 'microsoft-office'
cask 'pycharm'
{% endif %}

# Casks to install only on Work macOS systems
{% if 'work' in group_names %}
cask 'microsoft-remote-desktop-beta'
cask 'microsoft-teams'
cask 'transmit'
{% endif %}
